[
  {
    "path": "posts/2021-06-19-project-proposal/",
    "title": "Project Proposal",
    "description": "Group 1 Team 8 - VAST Challenge 2021.",
    "author": [
      {
        "name": "Aryah Umralkar Chopra, Davmes Tan, Rhoda Tong",
        "url": {}
      }
    ],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\nVAST Challenge 2021\r\nAs part of our module ISSS608 - Visual Analytics and Applications and VAST Challenge 2021, our team would be embarking on a project based on the context provided within VAST Challenge 2021.\r\nContext\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem. - extracted from VAST Challenge 2021 website here\r\nMotivation of the Project\r\nWe are the Visual Analytics Project Team that are called in to help the law enforcement from Kronos and Tethys. In broad, we would be attempting to merge/ link the insights discovered in Mini-Challenge 1 and Mini-Challenge 2. We would attempt to:\r\nEstablish linkages between organisations, people, places and events.\r\nIdentify possible official/non-official relationships among GASTech, POK, the APA and Government.\r\nPick up any anomalies with regard to people, activities and locations.\r\nEstablish possible linkages between the insights discovered\r\nOur Approach\r\nThe following are the broad approaches that we would be exploring:\r\nTransactions and Location Analysis and Visualization: Gain insights based on possible linkage between credit card and loyalty card transactions. In addition, with the GPS data, discover insights or linkages among them. We envisage development of a geographical trajectory of car movement with time for visualization.\r\nSocial Network Analysis and Visualization: Gain insights between the relationships among the people from their activities and communication. A social network would then be drawn up.\r\nMovement Analysis: With the location of the transactions, and the GPS data, to gain insights on the movement of individuals or groups.\r\nNew Analysis: To establish a timeline of a series of events, analysing trending articles from primary/ derivative sources.\r\nFacilitate story telling and aid in investigation via interesting and interactive Visuals\r\nThe Tasks\r\nMini-Challenge 1\r\nEstablish possible relationships between personnel. (Sources: resumes, email correspondences)\r\nResumes (go through employment history)\r\nEmail Correspondences (group titles, categorize personal and official notes etc.)\r\nIdentify any possible links with data from Mini-Challenge 2\r\n\r\nApply centrality and text mining concepts for correspondences\r\nMini-Challenge 2\r\nTrace the geolocation data of each personnel via the car assigned\r\nIdentify suspicious meet-ups between cars, meet-ups at odd timings\r\nAnalyse credit card and loyalty card transactions\r\nIntegrate credit card and loyalty card transaction data\r\nIdentify notable purchase patterns, establish frequency of visits at specific outlets\r\nTrace the person who is making the purchase via location and timing incidences of cars\r\nIdentify any possible links with data from Mini-Challenge 1\r\n\r\nR Shiny Plans\r\nTransactions Tab (Transactional data)\r\nSocial Network Tab (Mapping relationships, both personal and professional)\r\nPerson Location Tracking Tab (Map of the island, person’s whereabout, path tracking)\r\nNews Tab\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-04T12:08:41+08:00",
    "input_file": {}
  }
]
